# 1. Importing Pandas

In [2]:
import pandas as pd

# 2. Load Data

In [4]:
df = pd.read_csv('/content/tested.csv') # Load CSV

In [5]:
df1 = pd.read_excel('/content/Preprocessing_Data_I.xlsx') # Load Excel

# 3. View Data

In [6]:
df.head() # First 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
df.tail() # Last 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
df.sample(3) # Random 3 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
93,985,0,3,"Guest, Mr. Robert",male,NaN,0,0,376563,8.0500,NaN,S
312,1204,0,3,"Sadowitz, Mr. Harry",male,NaN,0,0,LP 1588,7.5750,NaN,S
21,913,0,3,"Olsen, Master. Artur Karl",male,9.0,0,1,C 17368,3.1708,NaN,S

# 4. Inspect Structure

In [9]:
df.shape # Rows and columns

(418, 12)

In [10]:
df.columns # Column names

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df.info() # Data types and nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [12]:
df.describe() # Summary stats

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

# 5. Handling missing values

In [13]:
df.isnull().sum() # Count nulls

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [14]:
df['Age'].fillna(df['Age'].mean(), inplace=True) # Fill with mean

/tmp/ipython-input-2238352095.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True) # Fill with mean

In [15]:
df.dropna(inplace=True) # Drop rows with any nulls

# 6. Removing Duplicates

In [16]:
df.duplicated().sum()

np.int64(0)

In [17]:
df.drop_duplicates(inplace=True)

# 7. Selecting columns

In [18]:
df['Name'] # Single column (Series)

12         Snyder, Mrs. John Pillsbury (Nelle Stevenson)
14     Chaffee, Mrs. Herbert Fuller (Carrie Constance...
24       Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
26                          Ostby, Miss. Helene Ragnhild
28                               Brady, Mr. John Bertram
                             ...
404                         Frauenthal, Mr. Isaac Gerald
405         Nourney, Mr. Alfred (Baron von Drachstedt")"
407                           Widener, Mr. George Dunton
411      Minahan, Mrs. William Edward (Lillian E Thorpe)
414                         Oliva y Ocana, Dona. Fermina
Name: Name, Length: 91, dtype: object

In [19]:
df[['Name', 'Age']] # Multiple columns (DataFrame)

                                                  Name   Age
12       Snyder, Mrs. John Pillsbury (Nelle Stevenson)  23.0
14   Chaffee, Mrs. Herbert Fuller (Carrie Constance...  47.0
24     Ryerson, Mrs. Arthur Larned (Emily Maria Borie)  48.0
26                        Ostby, Miss. Helene Ragnhild  22.0
28                             Brady, Mr. John Bertram  41.0
..                                                 ...   ...
404                       Frauenthal, Mr. Isaac Gerald  43.0
405       Nourney, Mr. Alfred (Baron von Drachstedt")"  20.0
407                         Widener, Mr. George Dunton  50.0
411    Minahan, Mrs. William Edward (Lillian E Thorpe)  37.0
414                       Oliva y Ocana, Dona. Fermina  39.0

[91 rows x 2 columns]

# 8. Filtering rows

In [20]:
df[df['Age'] > 30] # Age > 30

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.00000,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.00000,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
28,920,0,1,"Brady, Mr. John Bertram",male,41.00000,0,0,113054,30.5000,A21,S
41,933,0,1,"Franklin, Mr. Thomas Parham",male,30.27259,0,0,113778,26.5500,D34,S
44,936,1,1,"Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)",female,45.00000,1,0,11753,52.5542,D19,S
...,...,...,...,...,...,...,...,...,...,...,...,...
397,1289,1,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.00000,1,1,13567,79.2000,B41,C
404,1296,0,1,"Frauenthal, Mr. Isaac Gerald",male,43.00000,1,0,17765,27.7208,D40,C
407,1299,0,1,"Widener, Mr. George Dunton",male,50.00000,1,1,113503,211.5000,C80,C
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.00000,1,0,19928,90.0000,C78,Q
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.00000,0,0,PC 17758,108.9000,C105,C

In [21]:
df[df['Sex'] == 'female'] # All females

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
26,918,1,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
44,936,1,1,"Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)",female,45.0,1,0,11753,52.5542,D19,S
48,940,1,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60.0,0,0,11813,76.2917,D15,C
53,945,1,1,"Fortune, Miss. Ethel Flora",female,28.0,3,2,19950,263.0000,C23 C25 C27,S
59,951,1,1,"Chaudanson, Miss. Victorine",female,36.0,0,0,PC 17608,262.3750,B61,C
69,961,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S
74,966,1,1,"Geiger, Miss. Amalie",female,35.0,0,0,113503,211.5000,C130,C
77,969,1,1,"Cornell, Mrs. Robert Clifford (Malvina Helen L...",female,55.0,2,0,11770,25.7000,C101,S
92,984,1,1,"Davidson, Mrs. Thornton (Orian Hays)",female,27.0,1,2,F.C. 12750,52.0000,B71,S
96,988,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S
100,992,1,1,"Stengel, Mrs. Charles Emil Henry (Annie May Mo...",female,43.0,1,0,11778,55.4417,C116,C
112,1004,1,1,"Evans, Miss. Edith Corse",female,36.0,0,0,PC 17531,31.6792,A29,C
114,1006,1,1,"Straus, Mrs. Isidor (Rosalie Ida Blun)",female,63.0,1,0,PC 17483,221.7792,C55 C57,S
117,1009,1,3,"Sandstrom, Miss. Beatrice Irene",female,1.0,1,1,PP 9549,16.7000,G6,S
122,1014,1,1,"Schabert, Mrs. Paul (Emma Mock)",female,35.0,1,0,13236,57.7500,C28,C
150,1042,1,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,11767,83.1583,C54,C
156,1048,1,1,"Bird, Miss. Ellen",female,29.0,0,0,PC 17483,221.7792,C97,S
178,1070,1,2,"Becker, Mrs. Allen Oliver (Nellie E Baumgardner)",female,36.0,0,3,230136,39.0000,F4,S
179,1071,1,1,"Compton, Mrs. Alexander Taylor (Mary Eliza Ing...",female,64.0,0,2,PC 17756,83.1583,E45,C
182,1074,1,1,"Marvin, Mrs. Daniel Warner (Mary Graham Carmic...",female,18.0,1,0,113773,53.1000,D30,S
184,1076,1,1,"Douglas, Mrs. Frederick Charles (Mary Helene B...",female,27.0,1,1,PC 17558,247.5208,B58 B60,C
208,1100,1,1,"Rosenbaum, Miss. Edith Louise",female,33.0,0,0,PC 17613,27.7208,A11,C
218,1110,1,1,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0,1,1,113503,211.5000,C80,C
222,1114,1,2,"Cook, Mrs. (Selena Rogers)",female,22.0,0,0,W./C. 14266,10.5000,F33,S
239,1131,1,1,"Douglas, Mrs. Walter Donald (Mahala Dutton)",female,48.0,1,0,PC 17761,106.4250,C86,C
272,1164,1,1,"Clark, Mrs. Walter Miller (Virginia McDowell)",female,26.0,1,0,13508,136.7792,C89,C
305,1197,1,1,"Crosby, Mrs. Edward Gifford (Catherine Elizabe...",female,64.0,1,1,112901,26.5500,B26,S
314,1206,1,1,"White, Mrs. John Stuart (Ella Holmes)",female,55.0,0,0,PC 17760,135.6333,C32,C
326,1218,1,2,"Becker, Miss. Ruth Elizabeth",female,12.0,2,1,230136,39.0000,F4,S
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C
350,1242,1,1,"Greenfield, Mrs. Leo David (Blanche Strouse)",female,45.0,0,1,PC 17759,63.3583,D10 D12,C
356,1248,1,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59.0,2,0,11769,51.4792,C101,S
364,1256,1,1,"Harder, Mrs. George Achilles (Dorothy Annan)",female,25.0,1,0,11765,55.4417,E50,C
371,1263,1,1,"Wilson, Miss. Helen Alice",female,31.0,0,0,16966,134.5000,E39 E41,C
374,1266,1,1,"Dodge, Mrs. Washington (Ruth Vidaver)",female,54.0,1,1,33638,81.8583,A34,S
391,1283,1,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.0,0,1,PC 17592,39.4000,D28,S
395,1287,1,1,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,18.0,1,0,13695,60.0000,C31,S
397,1289,1,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.0,1,1,13567,79.2000,B41,C
400,1292,1,1,"Bonnell, Miss. Caroline",female,30.0,0,0,36928,164.8667,C7,S
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

In [22]:
df[(df['Age'] > 30) & (df['Sex'] == 'male')] # Compound filter

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
28,920,0,1,"Brady, Mr. John Bertram",male,41.00000,0,0,113054,30.5000,A21,S
41,933,0,1,"Franklin, Mr. Thomas Parham",male,30.27259,0,0,113778,26.5500,D34,S
46,938,0,1,"Chevre, Mr. Paul Romaine",male,45.00000,0,0,PC 17594,29.7000,A9,C
68,960,0,1,"Tucker, Mr. Gilbert Milligan Jr",male,31.00000,0,0,2543,28.5375,C53,C
75,967,0,1,"Keeping, Mr. Edwin",male,32.50000,0,0,113503,211.5000,C132,C
81,973,0,1,"Straus, Mr. Isidor",male,67.00000,1,0,PC 17483,221.7792,C55 C57,S
118,1010,0,1,"Beattie, Mr. Thomson",male,36.00000,0,0,13050,75.2417,C6,C
131,1023,0,1,"Gracie, Col. Archibald IV",male,53.00000,0,0,113780,28.5000,C51,C
142,1034,0,1,"Ryerson, Mr. Arthur Larned",male,61.00000,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
146,1038,0,1,"Hilliard, Mr. Herbert Henry",male,30.27259,0,0,17463,51.8625,E46,S
158,1050,0,1,"Borebank, Mr. John James",male,42.00000,0,0,110489,26.5500,D22,S
166,1058,0,1,"Brandeis, Mr. Emil",male,48.00000,0,0,PC 17591,50.4958,B10,C
177,1069,0,1,"Stengel, Mr. Charles Emil Henry",male,54.00000,1,0,11778,55.4417,C116,C
181,1073,0,1,"Compton, Mr. Alexander Taylor Jr",male,37.00000,1,1,PC 17756,83.1583,E52,C
202,1094,0,1,"Astor, Col. John Jacob",male,47.00000,1,0,PC 17757,227.5250,C62 C64,C
215,1107,0,1,"Head, Mr. Christopher",male,42.00000,0,0,113038,42.5000,B11,S
234,1126,0,1,"Cumings, Mr. John Bradley",male,39.00000,1,0,PC 17599,71.2833,C85,C
236,1128,0,1,"Warren, Mr. Frank Manley",male,64.00000,1,0,110813,75.2500,D37,C
242,1134,0,1,"Spedden, Mr. Frederic Oakley",male,45.00000,1,1,16966,134.5000,E34,C
245,1137,0,1,"Kenyon, Mr. Frederick R",male,41.00000,1,0,17464,51.8625,D21,S
270,1162,0,1,"McCaffry, Mr. Thomas Francis",male,46.00000,0,0,13050,75.2417,C6,C
288,1180,0,3,"Mardirosian, Mr. Sarkis",male,30.27259,0,0,2655,7.2292,F E46,C
293,1185,0,1,"Dodge, Dr. Washington",male,53.00000,1,1,33638,81.8583,A34,S
301,1193,0,2,"Malachard, Mr. Noel",male,30.27259,0,0,237735,15.0458,D,C
308,1200,0,1,"Hays, Mr. Charles Melville",male,55.00000,1,1,12749,93.5000,B69,S
316,1208,0,1,"Spencer, Mr. William Augustus",male,57.00000,1,0,PC 17569,146.5208,B78,C
331,1223,0,1,"Dulles, Mr. William Crothers",male,39.00000,0,0,PC 17580,29.7000,A18,C
355,1247,0,1,"Julian, Mr. Henry Forbes",male,50.00000,0,0,113044,26.0000,E60,S
372,1264,0,1,"Ismay, Mr. Joseph Bruce",male,49.00000,0,0,112058,0.0000,B52 B54 B56,S
378,1270,0,1,"Hipkins, Mr. William Edward",male,55.00000,0,0,680,50.0000,C39,S
404,1296,0,1,"Frauenthal, Mr. Isaac Gerald",male,43.00000,1,0,17765,27.7208,D40,C
407,1299,0,1,"Widener, Mr. George Dunton",male,50.00000,1,1,113503,211.5000,C80,C

# 9. Sorting data

In [23]:
df.sort_values(by='Age', ascending=True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
117,1009,1,3,"Sandstrom, Miss. Beatrice Irene",female,1.0,1,1,PP 9549,16.7000,G6,S
196,1088,0,1,"Spedden, Master. Robert Douglas",male,6.0,0,2,16966,134.5000,E34,C
326,1218,1,2,"Becker, Miss. Ruth Elizabeth",female,12.0,2,1,230136,39.0000,F4,S
64,956,0,1,"Ryerson, Master. John Borie",male,13.0,2,2,PC 17608,262.3750,B57 B59 B63 B66,C
395,1287,1,1,"Smith, Mrs. Lucien Philip (Mary Eloise Hughes)",female,18.0,1,0,13695,60.0000,C31,S
...,...,...,...,...,...,...,...,...,...,...,...,...
179,1071,1,1,"Compton, Mrs. Alexander Taylor (Mary Eliza Ing...",female,64.0,0,2,PC 17756,83.1583,E45,C
236,1128,0,1,"Warren, Mr. Frank Manley",male,64.0,1,0,110813,75.2500,D37,C
305,1197,1,1,"Crosby, Mrs. Edward Gifford (Catherine Elizabe...",female,64.0,1,1,112901,26.5500,B26,S
81,973,0,1,"Straus, Mr. Isidor",male,67.0,1,0,PC 17483,221.7792,C55 C57,S
96,988,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S

In [24]:
df.sort_values(by=['Pclass', 'Fare'], ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
343,1235,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.00000,0,1,PC 17755,512.3292,B51 B53 B55,C
53,945,1,1,"Fortune, Miss. Ethel Flora",female,28.00000,3,2,19950,263.0000,C23 C25 C27,S
69,961,1,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.00000,1,4,19950,263.0000,C23 C25 C27,S
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.00000,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
59,951,1,1,"Chaudanson, Miss. Victorine",female,36.00000,0,0,PC 17608,262.3750,B61,C
...,...,...,...,...,...,...,...,...,...,...,...,...
222,1114,1,2,"Cook, Mrs. (Selena Rogers)",female,22.00000,0,0,W./C. 14266,10.5000,F33,S
117,1009,1,3,"Sandstrom, Miss. Beatrice Irene",female,1.00000,1,1,PP 9549,16.7000,G6,S
57,949,0,3,"Abelseth, Mr. Olaus Jorgensen",male,25.00000,0,0,348122,7.6500,F G63,S
288,1180,0,3,"Mardirosian, Mr. Sarkis",male,30.27259,0,0,2655,7.2292,F E46,C
321,1213,0,3,"Krekorian, Mr. Neshan",male,25.00000,0,0,2654,7.2292,F E57,C

# 10. Creating new column

In [25]:
df['FamilySize'] = df['SibSp'] + df['Parch'] + 1

# 11. Dropping columns/rows

In [26]:
df.drop('Ticket', axis=1, inplace=True) # Drop column

In [28]:
# df.drop([0, 1], axis=0, inplace=True) # Drop rows by index
# (The error KeyError: '[0, 1] not found in axis' means that the DataFrame no longer has rows with index labels 0 and 1.
#This happened because previous operations like df.dropna() and df.drop_duplicates() modified the DataFrame and removed those original index labels.
#If you want to drop the first two rows of the current DataFrame, you need to reference their current index labels.
#I've updated the code to drop the first two rows based on their current labels.)
df.drop(df.index[:2], axis=0, inplace=True) # Drop the first two current rows

# 12. Remaining columns

In [27]:
df.rename(columns={'SibSp': 'SiblingsSpouses'}, inplace=True)

# 13. Value counts & unique

In [29]:
df['Sex'].value_counts()

Sex
male      47
female    42
Name: count, dtype: int64

In [30]:
df['Embarked'].unique()

array(['C', 'S', 'Q'], dtype=object)

In [31]:
df['Embarked'].nunique()

3

# 14. Grouping and aggregation

In [32]:
df.groupby('Pclass')['Fare'].mean()

Pclass
1    106.545247
2     20.486900
3      9.702100
Name: Fare, dtype: float64

In [33]:
df.groupby('Sex')['Survived'].sum()

Sex
female    42
male       0
Name: Survived, dtype: int64

In [34]:
df.groupby(['Pclass', 'Sex'])['Age'].median()

Pclass  Sex
1       female    41.0
        male      41.5
2       female    22.0
        male      23.0
3       female     1.0
        male      25.0
Name: Age, dtype: float64

# 15. Aggregating Multiple Columns

In [35]:
df.groupby('Pclass').agg({
'Age': ['mean', 'min'],
'Fare': ['max', 'mean']
})

              Age            Fare
             mean   min       max        mean
Pclass
1       41.276220   6.0  512.3292  106.545247
2       23.538941  12.0   39.0000   20.486900
3       20.318148   1.0   16.7000    9.702100

# 16. Apply Custom Functions

In [36]:
df['AgeSquared'] = df['Age'].apply(lambda x: x**2)

# 17. String operations

In [37]:
df['Name'].str.lower()

24     ryerson, mrs. arthur larned (emily maria borie)
26                        ostby, miss. helene ragnhild
28                             brady, mr. john bertram
34                            mock, mr. philipp edmund
41                         franklin, mr. thomas parham
                            ...
404                       frauenthal, mr. isaac gerald
405       nourney, mr. alfred (baron von drachstedt")"
407                         widener, mr. george dunton
411    minahan, mrs. william edward (lillian e thorpe)
414                       oliva y ocana, dona. fermina
Name: Name, Length: 89, dtype: object

In [38]:
df['Name'].str.contains('Mrs')

24      True
26     False
28     False
34     False
41     False
       ...
404    False
405    False
407    False
411     True
414    False
Name: Name, Length: 89, dtype: bool

# 18. Mapping and replacing values

In [39]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [40]:
df['Embarked'].replace({'S': 'Southampton', 'C': 'Cherbourg'}, inplace=True)

/tmp/ipython-input-952687161.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].replace({'S': 'Southampton', 'C': 'Cherbourg'}, inplace=True)

# 19. Combining Columns (concatenation)

In [41]:
df['FullName'] = df['Name'] + ' (' + df['Sex'].astype(str) + ')'

# 20. Merging Data frames

In [44]:
df2 = pd.read_csv('/content/tested.csv')

In [45]:
df = pd.merge(df, df2, on='PassengerId', how='left')

# 21. Concatenating dataframes

In [46]:
df_combined = pd.concat([df1, df2], axis=0) # Stack vertically

In [48]:
df_combined.head(5)

,SL No,Reviewer_Skill,Review_Type,Domain_Knowledge,Review_Time,Test_Coverage,Review_Coverage,Reuse,Review_Rate,Sprint_Prod,...,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1.0,4.0,1.0,4.0,30.0,100.0,70.0,30.0,3.0,0.46,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,5.0,2.0,5.0,20.0,70.0,100.0,15.0,1.0,0.08,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,4.0,1.0,4.0,20.0,70.0,100.0,15.0,2.0,0.11,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,4.0,1.0,4.0,30.0,70.0,70.0,50.0,4.0,0.73,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,5.0,2.0,5.0,NaN,100.0,NaN,50.0,4.0,0.50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

# 22. Pivot table

In [49]:
pd.pivot_table(df, values='Fare_x', index='Pclass_x', columns='Sex_x', aggfunc='mean')

Sex_x             0           1
Pclass_x
1         88.989895  125.024566
2         13.727075   29.500000
3          7.369467   16.700000

# 23. Resetting and setting index

In [50]:
df.reset_index(drop=True, inplace=True)

In [51]:
df.set_index('PassengerId', inplace=True)

# 24. Conditional column creation

In [53]:
df['AgeGroup'] = df['Age_x'].apply(lambda x: 'child' if x < 16 else 'adult')

# 25. Save Cleaned Data

In [60]:
df.to_csv('cleaned_titanic.csv', index=False)

In [59]:
df.to_excel('cleaned_data.xlsx', index=False)

To the system

In [61]:
df.to_csv(r'C:\Downloads\dataset.csv', index=False)